Repository: KryptonGao/StudyPulse
Catalog: StudyPulse/Localizable.xcstrings
Source language: en
Languages: ja, ko, zh_hans, zh_hant

source: - Manage mistake collections with detailed analysis
ja: - 错题コレクションを管理し詳細に分析
ko: - 오답 컬렉션을 관리하고 상세 분석
zh_hans: - 管理错题集并进行详细分析
zh_hant: - 管理錯題集並進行詳細分析

source: - Personalized learning recommendations
ja: - パーソナライズされた学習レコメンデーション
ko: - 맞춤 학습 추천
zh_hans: - 个性化学习推荐
zh_hant: - 個人化學習推薦

source: - Support for photo uploads for exam papers and mistakes
ja: - 試験問題と错题の写真アップロードに対応
ko: - 시험지와 오답 사진 업로드 지원
zh_hans: - 支持上传试卷和错题照片
zh_hant: - 支援上傳試卷和錯題照片

source: - Track grades across multiple subjects
ja: - 複数科目の成績を追跡
ko: - 여러 과목의 성적 추적
zh_hans: - 追踪多门科目的成绩
zh_hant: - 追蹤多門科目的成績

source: - Visualize progress with interactive charts
ja: - インタラクティブなチャートで学習进度を可視化
ko: - 인터랙티브 차트로 학습 진행 상황 시각화
zh_hans: - 通过交互式图表可视化学习进度
zh_hant: - 透過互動式圖表視覺化學習進度

source: (no name)
ja: (名前なし)
ko: (이름 없음)
zh_hans: (无名称)
zh_hant: (無名稱)

source: (No text)
ja: (テキストなし)
ko: (텍스트 없음)
zh_hans: (无文字)
zh_hant: (無文字)

source: %.1fh sleep
ja: %.1f時間睡眠
ko: %.1f시간 수면
zh_hans: %.1f 小时睡眠
zh_hant: %.1f 小時睡眠

source: %@ - %d day(s) until the exam. Get ready!
ja: %@ - 試験まであと %d 日。準備を整えましょう！
ko: %@ - 시험까지 %d일 남았습니다. 준비하세요!
zh_hans: %@ - 距离考试还有 %d 天。加油准备！
zh_hant: %@ - 距離考試還有 %d 天。加油準備！

source: %@ — fill out your review: what was tested, what went wrong, what you learned, next strategy.
ja: %@ の振り返り時間です。試験範囲 / 間違えた所 / 学んだこと / 次回対策を記入してください。
ko: %@ 회고 시간입니다. 시험 범위 / 틀린 부분 / 배운 점 / 다음 전략을 작성해 주세요.
zh_hans: %@ 的复盘时间到了,填写:考了什么 / 错什么 / 学到什么 / 下次策略。
zh_hant: %@ 的復盤時間到了,請填寫:考了什麼 / 錯什麼 / 學到什麼 / 下次策略。

source: %@ · %lld cached items
ja: %@ · %lld 件のキャッシュ項目
ko: %@ · 캐시 항목 %lld개
zh_hans: %@ · %lld 个缓存项目
zh_hant: %@ · %lld 個快取項目

source: %@ %d exams today/tomorrow
ja: %@ %d 件の試験
ko: %@ %d 개 시험
zh_hans: %@ %d 场考试
zh_hant: %@ %d 場考試

source: %@ is improving!
ja: %@ が向上しています！
ko: %@ 실력이 향상되고 있습니다!
zh_hans: %@ 正在进步！
zh_hant: %@ 正在進步！

source: %@ pts
ja: %@ 点
ko: %@ 점
zh_hans: %@ 分
zh_hant: %@ 分

source: %@ pts (%@)
ja: %@ 点/週 (%@)
ko: %@ 점/주 (%@)
zh_hans: %@ 分/周 (%@)
zh_hant: %@ 分/週 (%@)

source: %@ scores are slipping
ja: %@ の成績が下がっています
ko: %@ 성적이 하락 중입니다
zh_hans: %@ 成绩正在下滑
zh_hant: %@ 成績正在下滑

source: %d added this week
ja: 今週 %d 件追加
ko: 이번 주 추가 %d개
zh_hans: 本周新增 %d 道
zh_hant: 本週新增 %d 道

source: %d day(s) before
ja: %d 日前
ko: %d일 전
zh_hans: 考前 %d 天
zh_hant: 考前 %d 天

source: %d days
ja: %d 日
ko: %d일
zh_hans: %d 天
zh_hant: %d 天

source: %d days left
ja: 残り %d 日
ko: 남은 %d일
zh_hans: 剩余 %d 天
zh_hant: 剩餘 %d 天

source: %d due · %d upcoming this week
ja: %d 件本日 · 今週 %d 件予定
ko: %d건 오늘 · 이번 주 %d건 예정
zh_hans: %d 张到期 · 本周内还有 %d 张
zh_hant: %d 張到期 · 本週內還有 %d 張

source: %d exam(s) in the next 2 weeks. Organize your review by subject priority.
ja: 今後2週間で %d 件の試験があります。科目の優先順位に従って復習を計画しましょう。
ko: 앞으로 2주 안에 %d개의 시험이 있습니다. 과목 우선순위에 따라 복습을 계획하세요.
zh_hans: 未来两周有 %d 场考试，按科目优先级安排复习。
zh_hant: 未來兩週有 %d 場考試，按科目優先級安排複習。

source: %d min
ja: %d 分
ko: %d분
zh_hans: %d 分钟
zh_hant: %d 分鐘

source: %d min · 3 small wins at most
ja: %d 分 · 小さな達成は最大 3 件
ko: %d분 · 작은 목표 최대 3개
zh_hans: %d 分钟 · 最多完成 3 个小目标
zh_hant: %d 分鐘 · 最多完成 3 個小目標

source: %d mistakes
ja: ミス%d件
ko: 오답 %d개
zh_hans: %d 道错题
zh_hant: %d 道錯題

source: %d mistakes due
ja: %d 問の間違い
ko: %d 개 오답
zh_hans: %d 张错题待复习
zh_hant: %d 張錯題待複習

source: %d mistakes due now
ja: %d 問の間違いが復習待ち
ko: %d 개 오답 복습 필요
zh_hans: %d 张错题到期
zh_hant: %d 張錯題到期

source: %d mistakes will be exported
ja: %d 件の間違いをエクスポートします
ko: 오답 %d개가 내보내기 됩니다
zh_hans: 将导出 %d 道错题
zh_hant: 將匯出 %d 道錯題

source: %d new
ja: 新着 %d
ko: 신규 %d
zh_hans: 新增 %d
zh_hant: 新增 %d

source: %d records
ja: 合計 %d 件
ko: 총 %d건
zh_hans: 共 %d 条记录
zh_hant: 共 %d 條記錄

source: %d selected
ja: %d件選択中
ko: %d개 선택됨
zh_hans: 已选 %d 项
zh_hant: 已選 %d 項

source: %d subjects · %@
ja: %d 科目 · %@
ko: %d개 과목 · %@
zh_hans: %d 门科目 · %@
zh_hant: %d 門科目 · %@

source: %d warning(s)
ja: 警告 %d 件
ko: 경고 %d개
zh_hans: %d 条警告
zh_hant: %d 則警告

source: %dd / EWMA %dd
ja: %d 日 / EWMA %d 日
ko: %d일 / EWMA %d일
zh_hans: %d 天 / EWMA %d 天
zh_hant: %d 天 / EWMA %d 天

source: %lld cached items
ja: %lld 件のキャッシュ項目
ko: 캐시 항목 %lld개
zh_hans: %lld 个缓存项目
zh_hant: %lld 個快取項目

source: + %d more mistakes
ja: 他 %d 件の错题
ko: 오답 %d개 더 보기
zh_hans: 还有 %d 道错题
zh_hant: 還有 %d 題錯題

source: 🔴 High Priority
ja: 🔴 高優先度
ko: 🔴 높은 우선순위
zh_hans: 🔴 高优先级
zh_hant: 🔴 高優先

source: 🟡 Review Soon
ja: 🟡 もうすぐ復習
ko: 🟡 곧 복습
zh_hans: 🟡 即将复习
zh_hant: 🟡 即將複習

source: 🟢 Normal
ja: 🟢 通常
ko: 🟢 보통
zh_hans: 🟢 普通
zh_hant: 🟢 普通

source: 1 mistake due now
ja: 1 問の間違いが復習待ち
ko: 1 개 오답 복습 필요
zh_hans: 1 张错题到期
zh_hant: 1 張錯題到期

source: 1 task overdue
ja: 1 件のタスクが期限超過
ko: 1 개 작업 지연
zh_hans: 1 项待办已逾期
zh_hant: 1 項待辦已逾期

source: 1 Year
ja: 1 年
ko: 1년
zh_hans: 1 年
zh_hant: 1 年

source: 1-tap quick record
ja: ワンタップ簡易記録
ko: 원탭 빠른 기록
zh_hans: 一键快速记录
zh_hant: 一鍵快速記錄

source: 3 Months
ja: 3 か月
ko: 3개월
zh_hans: 3 个月
zh_hant: 3 個月

source: 4-section Markdown: tested / wrong / learned / strategy
ja: 4 セクションの Markdown: 試験範囲 / 間違えた所 / 学んだこと / 次回対策
ko: 4개 섹션 Markdown: 시험 범위 / 틀린 부분 / 배운 점 / 다음 전략
zh_hans: 4 段 Markdown 模板:考了什么 / 错什么 / 学到什么 / 下次策略
zh_hant: 4 段 Markdown 模板:考了什麼 / 錯什麼 / 學到什麼 / 下次策略

source: 5-hour goal reached
ja: 5 時間目標達成
ko: 5시간 목표 달성
zh_hans: 5 小时额度达标
zh_hant: 5 小時額度達標

source: 6 Months
ja: 6 か月
ko: 6개월
zh_hans: 6 个月
zh_hant: 6 個月

source: 7-day goal reached
ja: 7 日間目標達成
ko: 7일 목표 달성
zh_hans: 7 天额度达标
zh_hant: 7 天額度達標

source: 9+ hours of sleep last night. A great day to push on the toughest subject or take a practice test.
ja: 昨夜は 9 時間以上眠れました。今日は最も難しい科目に挑戦したり、模擬試験を受けるのに最適な日です。
ko: 어젯밤 9시간 이상 수면. 가장 어려운 과목에 도전하거나 모의 시험을 보기에 완벽한 날입니다.
zh_hans: 昨晚睡了 9 小时以上。今天非常适合攻克最难的科目或做一次模拟测试。
zh_hant: 昨晚睡了 9 小時以上。今天非常適合攻克最難的科目或做一次模擬測試。

# 20 分钟 · 10 道题
source: 20 minutes · 10 questions
ja: 20分 · 10問
ko: 20분 · 10문제
zh_hans: 20 分钟 · 10 道题
zh_hant: 20 分鐘 · 10 道題

source: 30-day subject data: %d grades · %d mistakes · %d min study
ja: 過去30日：成績%d件 · ミス%d件 · 学習%d分
ko: 최근 30일: 성적 %d개 · 오답 %d개 · 학습 %d분
zh_hans: 近 30 天：%d 条成绩 · %d 道错题 · 学习 %d 分钟
zh_hant: 近 30 天：%d 筆成績 · %d 道錯題 · 學習 %d 分鐘

source: 95% Confidence Interval
ja: 95%% 信頼区間
ko: 95%% 신뢰 구간
zh_hans: 95%% 置信区间
zh_hant: 95%% 置信區間

source: 95%% Confidence Interval (Sum)
ja: 95%% 信頼区間(合計)
ko: 95%% 신뢰 구간(합계)
zh_hans: 95%% 置信区间(合计)
zh_hant: 95%% 置信區間(合計)

source: 95%% Confidence Interval (Sum), ±%.1f pts
ja: 95%% 信頼区間(合計)、±%.1f 点
ko: 95%% 신뢰 구간(합계), ±%.1f 점
zh_hans: 95%% 置信区间(合计),±%.1f 分
zh_hant: 95%% 置信區間(合計),±%.1f 分

source: A daily notification nudges you to log your mood and reflections.
ja: 毎日通知で気分と振り返りの記録を促します。
ko: 매일 알림으로 기분과 회고 기록을 독려합니다.
zh_hans: 每日通知提醒你记录心情和反思。
zh_hant: 每日通知提醒你記錄心情和反思。

source: A fresh AI Coach proposal is ready to review.
ja: 新しいAI Coachの提案を作成しました。確認してください。
ko: 새 AI Coach 제안이 준비되었습니다. 검토해 주세요.
zh_hans: 新的 AI Coach 方案已生成，等待你查看。
zh_hant: 新的 AI Coach 方案已產生，等待你檢視。

source: A low resting heart rate (%.0f bpm) signals good recovery. A good day for sustained deep-focus study.
ja: 低い安静時心率（%.0f bpm）は良い回復のサイン。長時間ディープフォーカスで学習するのに最適な日です。
ko: 낮은 안정 심박수(%.0f bpm)는 좋은 회복의 신호. 오랫동안 깊은 집중으로 공부하기에 좋은 날입니다.
zh_hans: 较低的静息心率（%.0f 次/分钟）说明恢复良好，非常适合长时间深度学习。
zh_hant: 較低的靜息心率（%.0f 次/分鐘）說明恢復良好，非常適合長時間深度學習。

source: A new reminder will be created in the system Reminders app on save.
ja: 保存時にシステムリマインダーに新しい通知を作成します。
ko: 저장 시 시스템 리마인더에 새 알림이 만들어집니다.
zh_hans: 保存后会在系统提醒事项中新建一条。
zh_hant: 儲存後會在系統提醒事項中建立一則。

source: A reflection filled in within 24h of the exam. Edit anytime to add new insights.
ja: 試験終了後 24 時間以内に記入する振り返り。後からでも編集可能。
ko: 시험 종료 후 24시간 이내에 작성하는 회고입니다. 언제든지 편집 가능.
zh_hans: 考试结束 24h 内填写的复盘,任何时候都能编辑以补充新感悟。
zh_hant: 考試結束 24h 內填寫的復盤,任何時候都能編輯以補充新感悟。

source: A reminder will be created in the system Reminders app with the schedule above. The app will request Reminders permission on first save.
ja: 保存時にシステムリマインダーに通知が作成され、初回保存時にリマインダーへのアクセス許可を求めます。
ko: 저장 시 시스템 리마인더에 알림이 만들어지며, 첫 저장 시 리마인더 권한을 요청합니다.
zh_hans: 保存后会在系统提醒事项中创建一条提醒，首次保存会请求提醒事项权限。
zh_hant: 儲存後會在系統提醒事項中建立一則提醒，首次儲存會請求提醒事項權限。

source: Abandon
ja: 放棄
ko: 포기
zh_hans: 放弃
zh_hant: 放棄

source: Abandoned Goals
ja: 放棄した目標
ko: 포기한 목표
zh_hans: 已放弃目标
zh_hant: 已放棄目標

source: About
ja: 概要
ko: 정보
zh_hans: 关于
zh_hant: 關於

source: About StudyPulse
ja: StudyPulse について
ko: StudyPulse 소개
zh_hans: 关于 StudyPulse
zh_hant: 關於 StudyPulse

source: Academic Info
ja: 学習情報
ko: 학습 정보
zh_hans: 学业信息
zh_hant: 學業資訊

source: Academic Year
ja: 学年
ko: 학년도
zh_hans: 学年
zh_hant: 學年

source: Access is revoked instantly
ja: アクセス権は即座に取り消されます
ko: 권한은 즉시 철회됩니다
zh_hans: 权限立即撤销
zh_hant: 權限立即撤銷

# achievement.active_30.description
source: Be active for 30 total days
ja: 累計30日アクティブ
ko: 누적 30일 활성
zh_hans: 累计 30 天活跃
zh_hant: 累計 30 天活躍

# achievement.active_30.title
source: Monthly Active
ja: 月間アクティブ
ko: 월간 활성
zh_hans: 月度活跃
zh_hant: 月度活躍

# achievement.active_180.description
source: Be active for 180 total days
ja: 累計180日アクティブ
ko: 누적 180일 활성
zh_hans: 累计 180 天活跃
zh_hant: 累計 180 天活躍

# achievement.active_180.title
source: Semester Warrior
ja: 学期の戦士
ko: 학기 전사
zh_hans: 学期战士
zh_hant: 學期戰士

# achievement.first_step.description
source: Record your first learning activity
ja: 最初の学習活動を記録する
ko: 첫 학습 활동 기록하기
zh_hans: 记录你的第一次学习活动
zh_hant: 記錄你的第一次學習活動

# achievement.first_step.title
source: First Step
ja: 最初の一歩
ko: 첫걸음
zh_hans: 第一步
zh_hant: 第一步

# achievement.focus_100.description
source: Accumulate 100 focus minutes
ja: 100分の集中時間を積み重ねる
ko: 100분 집중 누적하기
zh_hans: 累计 100 分钟专注
zh_hant: 累計 100 分鐘專注

# achievement.focus_100.title
source: First Focus
ja: 初めての集中
ko: 첫 집중
zh_hans: 初次专注
zh_hant: 初次專注

# achievement.focus_600.description
source: Accumulate 600 focus minutes
ja: 600分の集中時間を積み重ねる
ko: 600분 집중 누적하기
zh_hans: 累计 600 分钟专注
zh_hant: 累計 600 分鐘專注

# achievement.focus_600.title
source: Deep Worker
ja: ディープワーカー
ko: 딥 워커
zh_hans: 深度工作者
zh_hant: 深度工作者

# achievement.focus_3000.description
source: Accumulate 3,000 focus minutes
ja: 3,000分の集中時間を積み重ねる
ko: 3,000분 집중 누적하기
zh_hans: 累计 3,000 分钟专注
zh_hant: 累計 3,000 分鐘專注

# achievement.focus_3000.title
source: Focus Champion
ja: 集中チャンピオン
ko: 집중 챔피언
zh_hans: 专注冠军
zh_hant: 專注冠軍

# achievement.goal_setter.description
source: Customize your daily goals
ja: 毎日の目標をカスタマイズする
ko: 매일 목표 사용자 지정하기
zh_hans: 自定义你的每日目标
zh_hant: 自訂你的每日目標

# achievement.goal_setter.title
source: Goal Setter
ja: 目標設定者
ko: 목표 설정자
zh_hans: 目标制定者
zh_hant: 目標制定者

# achievement.grades_10.description
source: Record 10 grades
ja: 10件の成績を記録する
ko: 10개 성적 기록하기
zh_hans: 记录 10 个成绩
zh_hant: 記錄 10 個成績

# achievement.grades_10.title
source: 10 Grades
ja: 10件の成績
ko: 10회 기록
zh_hans: 10 次记录
zh_hant: 10 次記錄

# achievement.grades_50.description
source: Record 50 grades
ja: 50件の成績を記録する
ko: 50개 성적 기록하기
zh_hans: 记录 50 个成绩
zh_hant: 記錄 50 個成績

# achievement.grades_50.title
source: 50 Grades
ja: 50件の成績
ko: 50회 기록
zh_hans: 50 次记录
zh_hant: 50 次記錄

# achievement.grades_200.description
source: Record 200 grades
ja: 200件の成績を記録する
ko: 200개 성적 기록하기
zh_hans: 记录 200 个成绩
zh_hant: 記錄 200 個成績

# achievement.grades_200.title
source: Grade Tracker
ja: 成績トラッカー
ko: 성적 트래커
zh_hans: 成绩追踪者
zh_hant: 成績追蹤者

# achievement.reviews_10.description
source: Review 10 mistakes
ja: 10問のミスを復習する
ko: 10문제 복습하기
zh_hans: 复习 10 道错题
zh_hant: 複習 10 道錯題

# achievement.reviews_10.title
source: 10 Reviews
ja: 10回復習
ko: 10회 복습
zh_hans: 10 次复习
zh_hant: 10 次複習

# achievement.reviews_50.description
source: Review 50 mistakes
ja: 50問のミスを復習する
ko: 50문제 복습하기
zh_hans: 复习 50 道错题
zh_hant: 複習 50 道錯題

# achievement.reviews_50.title
source: 50 Reviews
ja: 50回復習
ko: 50회 복습
zh_hans: 50 次复习
zh_hant: 50 次複習

# achievement.reviews_200.description
source: Review 200 mistakes
ja: 200問のミスを復習する
ko: 200문제 복습하기
zh_hans: 复习 200 道错题
zh_hant: 複習 200 道錯題

# achievement.reviews_200.title
source: 200 Reviews
ja: 200回復習
ko: 200회 복습
zh_hans: 200 次复习
zh_hant: 200 次複習

# achievement.reviews_1000.description
source: Review 1,000 mistakes
ja: 1,000問のミスを復習する
ko: 1,000문제 복습하기
zh_hans: 复习 1,000 道错题
zh_hant: 複習 1,000 道錯題

# achievement.reviews_1000.title
source: Review Master
ja: 復習マスター
ko: 복습 마스터
zh_hans: 复习大师
zh_hant: 複習大師

# achievement.streak_3.description
source: Maintain a 3-day streak
ja: 3日間のストリークを維持する
ko: 3일 스트릭 유지하기
zh_hans: 保持 3 天连续打卡
zh_hant: 保持 3 天連續打卡

# achievement.streak_3.title
source: 3-Day Spark
ja: 3日間の火花
ko: 3일의 불꽃
zh_hans: 三日之星
zh_hant: 三日之星

# achievement.streak_7.description
source: Maintain a 7-day streak
ja: 7日間のストリークを維持する
ko: 7일 스트릭 유지하기
zh_hans: 保持 7 天连续打卡
zh_hant: 保持 7 天連續打卡

# achievement.streak_7.title
source: 7-Day Flame
ja: 7日間の炎
ko: 7일의 불길
zh_hans: 七日之火
zh_hant: 七日之火

# achievement.streak_14.description
source: Maintain a 14-day streak
ja: 14日間のストリークを維持する
ko: 14일 스트릭 유지하기
zh_hans: 保持 14 天连续打卡
zh_hant: 保持 14 天連續打卡

# achievement.streak_14.title
source: Fortnight Fire
ja: 2週間の火
ko: 2주의 화염
zh_hans: 半月之力
zh_hant: 半月之力

# achievement.streak_30.description
source: Maintain a 30-day streak
ja: 30日間のストリークを維持する
ko: 30일 스트릭 유지하기
zh_hans: 保持 30 天连续打卡
zh_hant: 保持 30 天連續打卡

# achievement.streak_30.title
source: Monthly Momentum
ja: 月間モメンタム
ko: 월간 모멘텀
zh_hans: 月度动量
zh_hant: 月度動量

# achievement.streak_100.description
source: Maintain a 100-day streak
ja: 100日間のストリークを維持する
ko: 100일 스트릭 유지하기
zh_hans: 保持 100 天连续打卡
zh_hant: 保持 100 天連續打卡

# achievement.streak_100.title
source: Century Streak
ja: 100日間の旅
ko: 100일의 여정
zh_hans: 百日征途
zh_hant: 百日征途

# achievement.streak_365.description
source: Maintain a 365-day streak
ja: 365日間のストリークを維持する
ko: 365일 스트릭 유지하기
zh_hans: 保持 365 天连续打卡
zh_hant: 保持 365 天連續打卡

# achievement.streak_365.title
source: Year of Growth
ja: 成長の一年
ko: 성장의 1년
zh_hans: 一年成长
zh_hant: 一年成長

source: Achievements
ja: 実績
ko: 성취
zh_hans: 成就
zh_hant: 成就

source: Active
ja: アクティブ
ko: 활성
zh_hans: 进行中
zh_hant: 進行中

source: Active Goals
ja: 進行中の目標
ko: 진행 중인 목표
zh_hans: 进行中的目标
zh_hant: 進行中的目標

source: Active routine — %@ to %@
ja: 進行中ルーティン — %@ から %@
ko: 진행 중 루틴 — %@ 부터 %@
zh_hans: 进行中例程 — %@ 至 %@
zh_hant: 進行中例程 — %@ 至 %@

source: Active: %@
ja: 有効: %@
ko: 활성: %@
zh_hans: 当前激活: %@
zh_hant: 目前啟用: %@

source: Adapt Coach plan for major health changes
ja: 大きな体調変化に合わせてCoachプランを調整
ko: 큰 신체 상태 변화에 맞춰 Coach 계획 조정
zh_hans: 身体状态显著变化时调整 Coach 计划
zh_hant: 身體狀態顯著變化時調整 Coach 計畫

source: Add at least 2 grades for this subject to enable prediction.
ja: 予測を有効にするにはこの科目の成績が少なくとも 2 件必要です。
ko: 예측을 활성화하려면 이 과목의 성적이 최소 2개 이상 필요합니다.
zh_hans: 至少需要 2 条该科目的成绩才能开启预测。
zh_hant: 至少需要 2 筆該科目的成績才能開啟預測。

source: Add First Item
ja: 最初のタスクを追加
ko: 첫 항목 추가
zh_hans: 添加第一项
zh_hant: 新增第一項

source: Add Goal
ja: 目標を追加
ko: 목표 추가
zh_hans: 添加目标
zh_hant: 新增目標

source: Add Grade
ja: 成績を追加
ko: 성적 추가
zh_hans: 添加成绩
zh_hant: 新增成績

source: Add grades to see your trends here.
ja: 成績を追加すると、ここに傾向が表示されます。
ko: 성적을 추가하면 여기에 추세가 표시됩니다.
zh_hans: 添加成绩后将在此查看你的趋势。
zh_hant: 新增成績後將在此查看你的趨勢。

# Add item (e.g. 身份证, 2B 铅笔, 复习清单)
source: Add item (e.g. ID card, 2B pencil, review list)
ja: 項目を追加(例:身分証、2B 鉛筆、復習リスト)
ko: 항목 추가 (예: 신분증, 2B 연필, 복습 목록)
zh_hans: 添加项目(如 身份证、2B 铅笔、复习清单)
zh_hant: 新增項目(如 身份證、2B 鉛筆、複習清單)

source: Add mistakes to your review queue to start spaced repetition
ja: 間違えた問題を復習キューに追加して間隔反復を始めましょう
ko: 간격 반복을 시작하려면 문제를 복습 대기열에 추가하세요
zh_hans: 将错题加入复习队列，开启间隔重复
zh_hant: 將錯題加入複習隊列，開啟間隔重複

source: Add More Grades
ja: さらに成績を追加
ko: 더 많은 성적 추가
zh_hans: 添加更多成绩
zh_hant: 新增更多成績

source: Add New Grade
ja: 新しい成績を登録
ko: 새 성적 등록
zh_hans: 登记新成绩
zh_hant: 登記新成績

source: Add personalized study suggestions based on your recovery state
ja: 回復状態に応じたパーソナライズされた学習提案を追加
ko: 회복 상태에 맞춘 개인화 학습 제안 추가
zh_hans: 根据恢复状态生成个性化学习建议
zh_hant: 根據恢復狀態生成個性化學習建議

source: Add subject
ja: 科目を追加
ko: 과목 추가
zh_hans: 添加科目
zh_hant: 新增科目

source: Add Tag
ja: タグを追加
ko: 태그 추가
zh_hans: 添加标签
zh_hant: 新增標籤

source: Add this exam to your system calendar with a 1-day advance reminder.
ja: この試験をシステムカレンダーに追加し、1 日前にリマインドします。
ko: 이 시험을 시스템 캘린더에 추가하고 1일 전 미리 알림을 받습니다.
zh_hans: 将此考试添加到你的系统日历，并提前 1 天提醒。
zh_hant: 將此考試加入你的系統行事曆，並提前 1 天提醒。

source: Add to Calendar
ja: カレンダーに追加
ko: 캘린더에 추가
zh_hans: 添加到日历
zh_hant: 加入行事曆

source: Add to System Reminders
ja: システムリマインダーに追加
ko: 시스템 리마인더에 추가
zh_hans: 添加到系统提醒事项
zh_hant: 加入系統提醒事項

source: Add your first routine
ja: 最初のルーティンを追加
ko: 첫 루틴 추가
zh_hans: 添加第一个例程
zh_hant: 新增第一個例程

source: Added
ja: 追加済み
ko: 추가됨
zh_hans: 已添加
zh_hant: 已加入

source: Adds a Study Diary card to the home screen for daily mood and energy tracking.
ja: ホーム画面に学習日記カードを追加し、毎日の気分とエネルギーを記録します。
ko: 홈 화면에 학습 일기 카드를 추가하여 매일의 기분과 에너지를 기록합니다.
zh_hans: 在首页添加学习日记卡片,用于每日心情和精力记录。
zh_hant: 在首頁新增學習日記卡片,用於每日心情和精力記錄。

source: Advanced
ja: 詳細設定
ko: 고급
zh_hans: 高级
zh_hant: 進階

source: Affects AccentColor, trend line and progress bars throughout the app.
ja: アプリ全体の AccentColor、折れ線グラフ、プログレスバーに反映されます。
ko: 앱 전체의 AccentColor, 추세 선, 진행률 바에 반영됩니다.
zh_hans: 影响应用内 AccentColor、趋势折线和进度条。
zh_hant: 影響 App 內的 AccentColor、趨勢折線與進度條。

source: Again
ja: もう一度
ko: 다시
zh_hans: 重来
zh_hant: 重來

source: Age
ja: 年齢
ko: 나이
zh_hans: 年龄
zh_hant: 年齡

source: AI · BYOK · Provider
ja: AI · BYOK · プロバイダー
ko: AI · BYOK · 공급자
zh_hans: AI · 自带 Key · 服务商
zh_hant: AI · 自帶 Key · 服務商

source: AI Analysis
ja: AI 分析
ko: AI 분석
zh_hans: AI 解析
zh_hant: AI 解析

source: AI Assistant
ja: AI アシスタント
ko: AI 어시스턴트
zh_hans: AI 助手
zh_hant: AI 助手

source: AI Classified
ja: AI分類済み
ko: AI 자동 분류
zh_hans: AI 智能归类
zh_hant: AI 智能歸類

source: AI Coach is a separate opt-in. Major health changes are judged on-device; only then is a proposed plan generated through your configured LLM. Force refresh replaces any pending proposal, but it never changes Todo without your confirmation.
ja: AI Coachは個別に有効化する機能です。大きな体調変化は端末上で判定し、その後に設定済みのLLMで確認待ちプランを生成します。強制更新は確認待ちの提案を置き換えますが、確認なしにToDoを変更することはありません。
ko: AI Coach는 별도로 켜야 합니다. 큰 신체 상태 변화는 기기에서 판단하며, 그때만 설정한 LLM으로 검토 대기 계획을 생성합니다. 강제 새로고침은 대기 중인 제안을 교체하지만, 확인 없이 할 일을 변경하지 않습니다.
zh_hans: AI Coach 需要单独开启。身体状态的显著变化会先在设备本地判断，随后才会通过你配置的 LLM 生成待确认计划。强制刷新会替换现有待确认方案，但绝不会未经确认修改待办。
zh_hant: AI Coach 需要個別開啟。身體狀態的顯著變化會先在裝置本機判斷，之後才會透過你設定的 LLM 產生待確認計畫。強制重新整理會取代目前待確認方案，但絕不會未經確認修改待辦。

source: AI Coach is a separate opt-in. Major health changes are judged on-device; only then is a proposed plan generated through your configured LLM. It never changes Todo without your confirmation.
ja: AI Coachは個別に有効化する機能です。大きな体調変化は端末上で判定し、その後に設定済みのLLMで確認待ちプランを生成します。確認なしにToDoを変更することはありません。
ko: AI Coach는 별도로 켜야 합니다. 큰 신체 상태 변화는 기기에서 판단하며, 그때만 설정한 LLM으로 검토 대기 계획을 생성합니다. 확인 없이 할 일을 변경하지 않습니다.
zh_hans: AI Coach 需要单独开启。身体状态的显著变化会先在设备本地判断，随后才会通过你配置的 LLM 生成待确认计划；它绝不会未经确认修改待办。
zh_hant: AI Coach 需要個別開啟。身體狀態的顯著變化會先在裝置本機判斷，之後才會透過你設定的 LLM 產生待確認計畫；它絕不會未經確認修改待辦。

source: AI Explain Concept
ja: AIでこの知識点を説明する
ko: AI로 이 개념 설명하기
zh_hans: AI 讲解这个知识点
zh_hant: AI 講解這個知識點

# AI explain concept query
source: Explain the academic concept: "%@" in detail, summarizing key exam focus areas.
ja: 知識点「%@」について詳細に説明し、試験での出題ポイントとよくある注意点をまとめてください。
ko: 개념 "%@"에 대해 상세히 설명하고, 시험 출제 포인트와 자주 실수하는 함정을 정리해 주세요.
zh_hans: 详细讲解知识点：“%@”，总结其在考试中的核心考点与常见避坑指南。
zh_hant: 詳細講解知識點：「%@」，總結其在考試中的核心考點與常見避坑指南。

source: AI Interpretation
ja: AI解説
ko: AI 해석
zh_hans: AI 解读
zh_hant: AI 解讀

source: AI Metacognition Reflection
ja: AIメタ認知振り返り
ko: AI 메타인지 회고
zh_hans: AI 元认知反思
zh_hant: AI 後設認知反思

source: AI Mind Maps
ja: AI マインドマップ
ko: AI 마인드맵
zh_hans: AI 思维导图
zh_hant: AI 心智圖

source: AI Rate Limits
ja: AI リクエスト制限
ko: AI 요청 제한
zh_hans: AI 请求限制
zh_hant: AI 請求限制

source: AI Reflection
ja: AI振り返り
ko: AI 회고
zh_hans: AI 反思
zh_hant: AI 反思

source: AI Response Cache
ja: AI 応答キャッシュ
ko: AI 응답 캐시
zh_hans: AI 响应缓存
zh_hant: AI 回應快取

# AI 变式题
source: AI Similar Question
ja: AI 類題
ko: AI 유사 문제
zh_hans: AI 变式题
zh_hant: AI 變式題

# AI 建议不可用,显示本地版本
source: AI suggestion unavailable — showing local version
ja: AI 提案は利用できません — ローカル版を表示
ko: AI 제안 사용 불가 — 로컬 버전 표시
zh_hans: AI 建议不可用,显示本地版本
zh_hant: AI 建議不可用,顯示本地版本

# AI 总分预测
source: AI Total Score Prediction
ja: AI 合計点予測
ko: AI 총점 예측
zh_hans: AI 总分预测
zh_hant: AI 總分預測

# AI 总分预测 · 深入探讨
source: AI Total Score · Discuss Further
ja: AI 合計点予測 · さらに議論
ko: AI 총점 예측 · 심층 토론
zh_hans: AI 总分预测 · 深入探讨
zh_hant: AI 總分預測 · 深入探討

# AI 总结
source: AI Summary
ja: AI まとめ
ko: AI 요약
zh_hans: AI 总结
zh_hant: AI 總結

# AI 正在准备 10 道题，这通常需要 15–30 秒。
source: AI is preparing 10 questions. This usually takes 15–30 seconds.
ja: AIが10問を準備しています。通常15〜30秒かかります。
ko: AI가 10문제를 준비하고 있습니다. 보통 15~30초가 걸립니다.
zh_hans: AI 正在准备 10 道题，这通常需要 15–30 秒。
zh_hant: AI 正在準備 10 道題，通常需要 15–30 秒。

# AI 正在构思变式题...
source: AI is crafting a similar question...
ja: AIが類題を作成中...
ko: AI가 유사 문제를 생성 중...
zh_hans: AI 正在构思变式题…
zh_hant: AI 正在構思變式題…

# AI 正在阅卷并识别本次可改变的考场模式。
source: AI is grading the paper and identifying the changeable pattern shown in this session.
ja: AIが採点し、今回見られた改善可能な試験パターンを分析しています。
ko: AI가 채점하고 이번 세션에서 바꿀 수 있는 시험 패턴을 분석하고 있습니다.
zh_hans: AI 正在阅卷并识别本次可改变的考场模式。
zh_hant: AI 正在閱卷並辨識本次可改變的考場模式。

# AI 相似题组卷
source: AI Similar Question
ja: AI 類題生成
ko: AI 유사 문제 생성
zh_hans: AI 相似题组卷
zh_hant: AI 相似題組卷

# AI 解析失败
source: AI 解析 failed
ja: AI 解析失敗
ko: AI 분석 실패
zh_hans: AI 解析失败
zh_hant: AI 解析失敗

# AI 解析错因
source: AI Mistake Analysis
ja: AI ミス分析
ko: AI 오답 분석
zh_hans: AI 解析错因
zh_hant: AI 解析錯因

# AI 预测
source: AI Prediction
ja: AI 予測
ko: AI 예측
zh_hans: AI 预测
zh_hant: AI 預測

# AI 预测 · 深入探讨
source: AI Prediction · Discuss Further
ja: AI 予測 · さらに議論
ko: AI 예측 · 심층 토론
zh_hans: AI 预测 · 深入探讨
zh_hant: AI 預測 · 深入探討

# AI正在为您生成专属内容...
source: AI is generating exclusive content for you...
ja: AIがあなた専用のコンテンツを生成中...
ko: AI가 맞춤형 콘텐츠를 생성하는 중...
zh_hans: AI正在为您生成专属内容…
zh_hant: AI正在為您生成專屬內容…

# AI正在提炼表达...
source: AI is refining expression...
ja: AIが表現を精査中...
ko: AI가 표현을 다듬는 중...
zh_hans: AI正在提炼表达…
zh_hant: AI正在提煉表達…

# AI正在构建逻辑模型...
source: AI is building logical models...
ja: AIが論理モデルを構築中...
ko: AI가 논리 모델을 구축하는 중...
zh_hans: AI正在构建逻辑模型…
zh_hant: AI正在構建邏輯模型…

# AI正在结合历史数据...
source: AI is integrating historical data...
ja: AIが過去データを統合中...
ko: AI가 학습 이력을 분석하는 중...
zh_hans: AI正在结合历史数据…
zh_hant: AI正在結合歷史數據…

source: Alias
ja: 別名
ko: 별칭
zh_hans: 别名
zh_hant: 別名

source: All
ja: すべて
ko: 전체
zh_hans: 全部
zh_hant: 全部

source: All clear
ja: 今日は予定なし
ko: 오늘은 할 일이 없어요
zh_hans: 今日无事
zh_hant: 今日無事

source: All Data
ja: すべてのデータ
ko: 모든 데이터
zh_hans: 全部数据
zh_hant: 全部資料

source: All Day
ja: 終日
ko: 종일
zh_hans: 全天
zh_hant: 全天

source: All Mistakes (%d)
ja: すべての错题（%d）
ko: 모든 오답 (%d)
zh_hans: 全部错题（%d）
zh_hant: 全部錯題（%d）

source: All processing happens on your device
ja: すべての処理はあなたのデバイス上で行われます
ko: 모든 처리는 기기에서 이루어집니다
zh_hans: 所有处理都在你的设备上完成
zh_hant: 所有處理都在你的裝置上完成

source: All routines
ja: すべてのルーティン
ko: 모든 루틴
zh_hans: 全部例程
zh_hant: 全部例程

source: All Time
ja: 全期間
ko: 전체 기간
zh_hans: 全部时间
zh_hant: 全部時間

source: All your data is stored locally on your device in the app's Documents folder. Grade photos and avatar images are saved as separate files. StudyPulse does not upload any of your data to external servers. If HealthKit is enabled, HRV and other health signals are read directly from Apple Health and remain on your device.
ja: すべてのデータは端末のアプリのDocumentsフォルダにローカル保存されます。成績写真やアバター画像は別ファイルとして保存されます。StudyPulseはデータを外部サーバーにアップロードしません。HealthKitを有効にすると、HRVなどの健康データはApple Healthから直接読み取られ、端末上に留まります。
ko: 모든 데이터는 기기의 앱 Documents 폴더에 로컬로 저장됩니다. 성적 사진과 아바타 이미지는 별도 파일로 저장됩니다. StudyPulse는 데이터를 외부 서버에 업로드하지 않습니다. HealthKit이 활성화되면 HRV 및 기타 건강 신호가 Apple Health에서 직접 읽혀 기기에 남습니다.
zh_hans: 您的所有数据都存储在设备本地的应用 Documents 文件夹中。成绩照片和头像图片保存为独立文件。StudyPulse 不会将您的任何数据上传到外部服务器。如果启用了 HealthKit，HRV 和其他健康信号将直接从 Apple Health 读取并保留在您的设备上。
zh_hant: 您的所有數據都存儲在設備本地的應用 Documents 文件夾中。成績照片和頭像圖片儲存為獨立文件。StudyPulse 不會將您的任何數據上傳到外部伺服器。如果啟用了 HealthKit，HRV 和其他健康信號將直接從 Apple Health 讀取並保留在您的裝置上。

source: All-day subjects use one calendar event; subjects with time slots use individual events.
ja: 終日科目は 1 つのカレンダーイベント、時刻指定科目は個別のイベントとして登録されます。
ko: 종일 과목은 하나의 일정으로, 시간 지정 과목은 각각 일정으로 등록됩니다.
zh_hans: 全天科目共用一个日历事件,有具体时间的科目各自一个事件。
zh_hant: 全天科目共用一個日曆事件,有具體時間的科目各自一個事件。

source: Alternative: %@
ja: 代替案：%@
ko: 대안: %@
zh_hans: 替代方案：%@
zh_hant: 替代方案：%@

source: Analysis trend
ja: 分析の推移
ko: 분석 추이
zh_hans: 分析趋势
zh_hant: 分析趨勢

source: Analyze Now
ja: 今すぐ分析
ko: 지금 분석
zh_hans: 立刻分析
zh_hant: 立即分析

source: Analyzing...
ja: 分析中...
ko: 분석 중...
zh_hans: 正在分析...
zh_hant: 正在分析...

source: Answer
ja: 解答
ko: 정답
zh_hans: 答案
zh_hant: 答案
